pd_disagg/results/b1_matrix/raw/20260821T1842_replica2_512x128_sweep_rps11.7_bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x78b75e65b560>, trust_remote_code=False, seed=1005, num_prompts=320, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='localhost', port=8300, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen2-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=11.7, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='results/b1_matrix/raw', result_filename='20260821T1842_replica2_512x128_sweep_rps11.7_bench.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-8e18d6a2-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-21 18:42:22 [utils.py:90] Sampling input_len from [512, 512] and output_len from [128, 128]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 11.7
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 320/320 [00:29<00:00, 10.81it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     320       
Failed requests:                         0         
Request rate configured (RPS):           11.70     
Benchmark duration (s):                  29.60     
Total input tokens:                      163840    
Total generated tokens:                  40960     
Request throughput (req/s):              10.81     
Output token throughput (tok/s):         1383.78   
Peak output token throughput (tok/s):    2160.00   
Peak concurrent requests:                59.00     
Total token throughput (tok/s):          6918.91   
---------------Time to First Token----------------
Mean TTFT (ms):                          109.80    
Median TTFT (ms):                        105.46    
P50 TTFT (ms):                           105.46    
P90 TTFT (ms):                           137.06    
P99 TTFT (ms):                           165.86    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.04     
Median TPOT (ms):                        23.26     
P50 TPOT (ms):                           23.26     
P90 TPOT (ms):                           25.04     
P99 TPOT (ms):                           25.61     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.04     
Median ITL (ms):                         18.17     
P50 ITL (ms):                            18.17     
P90 ITL (ms):                            48.47     
P99 ITL (ms):                            58.94     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          3036.40   
Median E2EL (ms):                        3057.41   
P50 E2EL (ms):                           3057.41   
P90 E2EL (ms):                           3292.50   
P99 E2EL (ms):                           3359.25   
==================================================